# Config Single Area OSPFv2

```sh
Router> enable
Router# configure terminal

! Set the OSPF process ID (can be any number, local to the router)
Router(config)# router ospf 1

! Set a Router ID (unique 32-bit number)
Router(config-router)# router-id 1.1.1.1

! Advertise networks into OSPF with wildcard mask and area number
Router(config-router)# network 192.168.1.0 0.0.0.255 area 0
Router(config-router)# network 192.168.2.0 0.0.0.255 area 0

! Exit configuration mode
Router(config-router)# exit
Router(config)# exit

! Save the configuration
Router# write memory
```sh
! Configure IPs and Interfaces

!R1
interface g0/0
 ip address 192.168.1.1 255.255.255.0
 no shutdown

interface g0/1
 ip address 192.168.12.1 255.255.255.252
 no shutdown

interface g0/2
 ip address 192.168.13.1 255.255.255.252
 no shutdown

!R2
interface g0/0
 ip address 192.168.2.1 255.255.255.0
 no shutdown

interface g0/1
 ip address 192.168.12.2 255.255.255.252
 no shutdown

interface g0/2
 ip address 192.168.23.1 255.255.255.252
 no shutdown

!R3
interface g0/0
 ip address 192.168.3.1 255.255.255.0
 no shutdown

interface g0/1
 ip address 192.168.23.2 255.255.255.252
 no shutdown

interface g0/2
 ip address 192.168.13.2 255.255.255.252
 no shutdown

! Configure OSPF on All Routers

!R1
router ospf 1
 router-id 1.1.1.1
 network 192.168.1.0 0.0.0.255 area 0
 network 192.168.12.0 0.0.0.3 area 0
 network 192.168.13.0 0.0.0.3 area 0

!R2
router ospf 1
 router-id 2.2.2.2
 network 192.168.2.0 0.0.0.255 area 0
 network 192.168.12.0 0.0.0.3 area 0
 network 192.168.23.0 0.0.0.3 area 0

!R3
router ospf 1
 router-id 3.3.3.3
 network 192.168.3.0 0.0.0.255 area 0
 network 192.168.23.0 0.0.0.3 area 0
 network 192.168.13.0 0.0.0.3 area 0

```
# Config Extended ACLs

```sh
Router(config)# access-list 100 permit tcp 192.168.1.0 0.0.0.255 host 192.168.2.10 eq 80
Router(config)# access-list 100 deny ip any any

Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip access-group 100 in

```
```sh
! R1
interface g0/0
 ip address 192.168.1.1 255.255.255.0
 no shutdown

interface g0/1
 ip address 192.168.2.1 255.255.255.0
 no shutdown

ip access-list extended BLOCK_WEBSERVER
 deny tcp host 192.168.1.20 host 192.168.2.100 eq 80
 permit ip any any

interface g0/0
 ip access-group BLOCK_WEBSERVER in

```

# Config Static NAT & PAT

## STATIC NAT Configuration

```sh
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# ip nat inside
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip address 203.0.113.1 255.255.255.0
Router(config-if)# ip nat outside
Router(config-if)# exit

! Static NAT mapping
Router(config)# ip nat inside source static 192.168.1.10 203.0.113.10

```
```sh
interface g0/0
 ip address 192.168.1.1 255.255.255.0
 ip nat inside
 no shutdown

interface g0/1
 ip address 203.0.113.2 255.255.255.0
 ip nat outside
 no shutdown

ip nat inside source static 192.168.1.100 203.0.113.100

```
## PAT (Overloading) Configuration

```sh
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255

! Define inside and outside interfaces
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip nat inside
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip nat outside
Router(config-if)# exit

! Enable PAT (overload keyword is key here)
Router(config)# ip nat inside source list 1 interface GigabitEthernet0/1 overload

```
```sh
! R1
interface g0/0
 ip address 192.168.1.1 255.255.255.0
 ip nat inside
 no shutdown

interface g0/1
 ip address 203.0.113.2 255.255.255.0
 ip nat outside
 no shutdown

access-list 1 permit 192.168.1.0 0.0.0.255
ip nat inside source list 1 interface g0/1 overload

```
